Data.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
     <HotelSearchAvailabilityReq xmlns="http://www.travelport.com/schema/hotel_v42_0" TraceId="8cd78dc5-9210-4195-becf-121259edd188" AuthorizedBy="Travelport" TargetBranch="P7178562">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v42_0" OriginApplication="uAPI" />
  <HotelSearchLocation>
    <ReferencePoint>Lahore</ReferencePoint>
  </HotelSearchLocation>
  <HotelSearchModifiers NumberOfAdults="1" NumberOfRooms="1">
    <PermittedProviders xmlns="http://www.travelport.com/schema/common_v42_0">
      <Provider Code="1G" />
    </PermittedProviders>
  </HotelSearchModifiers>
  <HotelStay>
    <CheckinDate>2022-10-25</CheckinDate>
    <CheckoutDate>2022-10-27</CheckoutDate>
  </HotelStay>
  <!-- <HotelBedding Type="RollawayAdult" />
    <HotelBedding Type="Crib" />
    <NumberOfChildren Count="2">
      <Age>2</Age>
      <Age>4</Age>
    </NumberOfChildren> -->
</HotelSearchAvailabilityReq>
   </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
     <HotelSearchAvailabilityReq xmlns="http://www.travelport.com/schema/hotel_v52_0" TraceId="8cd78dc5-9210-4195-becf-456hy34khf34ew3" AuthorizedBy="Travelport" TargetBranch="P7178562">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v52_0" OriginApplication="uAPI" />
  <HotelSearchLocation>
	<CoordinateLocation Latitude="31.5204" Longitude="74.3587"></CoordinateLocation>
  </HotelSearchLocation>
  <HotelSearchModifiers NumberOfAdults="1" NumberOfRooms="1">
    <PermittedProviders xmlns="http://www.travelport.com/schema/common_v52_0">
      <Provider Code="1G" />
    </PermittedProviders>
  </HotelSearchModifiers>
  <HotelStay>
    <CheckinDate>2022-10-25</CheckinDate>
    <CheckoutDate>2022-10-27</CheckoutDate>
  </HotelStay>
</HotelSearchAvailabilityReq>
   </soapenv:Body>
</soapenv:Envelope>

Universal API/uAPI9475256727-15865f10
https://emea.universal-api.pp.travelport.com/B2BGateway/connect/uAPI/HotelService



[
    {
        "Data": {
            "_id": "640070e76f0bb90d4e4a7584",
            "TraceId": "8cd78dc5-9210-4195-becf-456hy34khf34ew3",
            "TransactionId": "A1B902590A0E7DED5083E44E4EDBB65B",
            "LocatorCode": "3WS370",
            "Version": "1",
            "Status": "Active",
            "BookingTraveler": {
                "TravelerType": "ADT",
                "BookingTraveler_First": "mudassar",
                "BookingTraveler_Last": "Iqbal",
                "BookingTraveler_Type": "Home",
                "BookingTraveler_Location": "ROM",
                "BookingTraveler_CountryCode": "+92",
                "BookingTraveler_Number": "21412",
                "BookingTraveler_AreaCode": "5505"
            },
            "OSI": {
                "Carrier": "1G",
                "Text": "UI92019ARR02MAY CXL:CXL 1 DAY PRIOR TO ARR BY 4PM HOTEL TIME OR 1N",
                "ProviderReservationInfoRef": "Sz1wFaXEuDKANazE8MAAAA=="
            },
            "ProviderReservationInfo": {
                "ProviderCode": "1G",
                "LocatorCode": "3WS370",
                "CreateDate": "2023-03-02T05:05:15.173+00:00",
                "ModifiedDate": "2023-03-02T05:05:15.442+00:00",
                "HostCreateDate": "2023-03-02",
                "OwningPCC": "87K4"
            },
            "GeneralRemark": [
                {
                    "SupplierType": "Hotel",
                    "ProviderCode": "1G",
                    "ProviderReservationInfoRef": "Sz1wFaXEuDKANazE8MAAAA==",
                    "ElStat": "A",
                    "RemarkData": "Hotel Chain: UI Check In Date: 2023-05-02 Booking Confirmation Number: 149171176541 Cancel Confirmation Num: 227389228620"
                }
            ],
            "AgentActionLength": [
                {
                    "ActionType": "Created",
                    "AgentCode": "uAPI1923620122-f5ee7bda",
                    "BranchCode": "P4090687",
                    "AgencyCode": "S4090680",
                    "EventTime": "2023-03-02T05:05:11.245+00:00"
                },
                {
                    "ActionType": "Modified",
                    "AgentCode": "uAPI1923620122-f5ee7bda",
                    "BranchCode": "P4090687",
                    "AgencyCode": "S4090680",
                    "EventTime": "2023-03-02T09:48:22.096+00:00"
                }
            ],
            "UserID": "BookingAsGuest"
        },
        "success": true,
        "statusCode": 200,
        "message": "Successful operation"
    },
    {
        "Data": {
            "_id": "640070ea6f0bb90d4e4a7587",
            "TraceId": "8cd78dc5-9210-4195-becf-456hy34khf34ew3",
            "TransactionId": "A1B910500A0EE0A9798FD007BB626AAA",
            "LocatorCode": "3WS36C",
            "Version": "1",
            "Status": "Active",
            "BookingTraveler": {
                "TravelerType": "ADT",
                "BookingTraveler_First": "mudassar",
                "BookingTraveler_Last": "Iqbal",
                "BookingTraveler_Type": "Home",
                "BookingTraveler_Location": "ROM",
                "BookingTraveler_CountryCode": "+92",
                "BookingTraveler_Number": "21412",
                "BookingTraveler_AreaCode": "5505"
            },
            "OSI": {
                "Carrier": "1G",
                "Text": "UI92019ARR02MAY CXL:CXL 1 DAY PRIOR TO ARR BY 4PM HOTEL TIME OR 1N",
                "ProviderReservationInfoRef": "L4/uFajDuDKAaUpb8MAAAA=="
            },
            "ProviderReservationInfo": {
                "ProviderCode": "1G",
                "LocatorCode": "3WS36C",
                "CreateDate": "2023-03-02T05:05:10.790+00:00",
                "ModifiedDate": "2023-03-02T05:05:10.954+00:00",
                "HostCreateDate": "2023-03-02",
                "OwningPCC": "87K4"
            },
            "GeneralRemark": [
                {
                    "SupplierType": "Hotel",
                    "ProviderCode": "1G",
                    "ProviderReservationInfoRef": "L4/uFajDuDKAaUpb8MAAAA==",
                    "ElStat": "A",
                    "RemarkData": "Hotel Chain: UI Check In Date: 2023-05-02 Booking Confirmation Number: 109172039001 Cancel Confirmation Num: 267387665660"
                }
            ],
            "AgentActionLength": [
                {
                    "ActionType": "Created",
                    "AgentCode": "uAPI1923620122-f5ee7bda",
                    "BranchCode": "P4090687",
                    "AgencyCode": "S4090680",
                    "EventTime": "2023-03-02T05:05:06.278+00:00"
                },
                {
                    "ActionType": "Modified",
                    "AgentCode": "uAPI1923620122-f5ee7bda",
                    "BranchCode": "P4090687",
                    "AgencyCode": "S4090680",
                    "EventTime": "2023-03-02T09:48:25.602+00:00"
                }
            ],
            "UserID": "BookingAsGuest"
        },
        "success": true,
        "statusCode": 200,
        "message": "Successful operation"
    }
]



[
    {
        "Rooms": 1,
        "Adults": 4,
        "Childrens": 1,
        "ChildrensAges": [
            { "Age" : 1}
        ]
    },
        {
        "Rooms": 1,
        "Adults": 4,
        "Childrens": 1,
        "ChildrensAges": [
             { "Age" : 2}
        ]
    } 
]